app/controllers/api/v1/book_controller.rb

    def index
        @book = Book.all
---
SELECT `books`.* FROM `books`

    def show
        begin
            @book = Book.find(params[:id])
---
SELECT `books`.* FROM `books` WHERE `books`.`B_id` = 4 LIMIT 1

    def create
        begin
            @book = Book.new(book_params)
            @book.save
---
INSERT INTO `books` (`B_id`, `B_title`, `Author`, `Publisher`, `Year`, `created_at`, `updated_at`) VALUES (5, 'Junior Level Books Introduction to Computer', 'Amit Garg', 'Reader\'s Zone', '2011-01-01', '2021-11-14 07:36:17.494324', '2021-11-14 07:36:17.494324')

    def update
        begin
            @book = Book.find(params[:id])
            @book.update(book_params)
---
SELECT `books`.* FROM `books` WHERE `books`.`B_id` = 28 LIMIT 1
UPDATE `books` SET `books`.`B_title` = ' Productivity in Software Engineering', `books`.`updated_at` = '2021-11-14 08:03:18.543482' WHERE `books`.`B_id` = 28

    def destroy
        begin
            @book = Book.find(params[:id])
            render json: {message: 'Book sucessfully deleted' },status: 200
            @book.destroy
---
SELECT `books`.* FROM `books` WHERE `books`.`B_id` = 3 LIMIT 1
DELETE FROM `books` WHERE `books`.`B_id` = 1